In [2]:
# imports

import pandas as pd
import numpy as np

In [14]:
# read dataframe from clipboard

try:
    df=pd.read_clipboard()
except:
    print('some kind of error')
    df=pd.read_csv('sampleData01.csv')
    df = pd.DataFrame({'name':['asda','Morrisons','Aldi','lidl'], 'volume':[4000,4000,2700,2100]})
    
df
df.shape

some kind of error

(4, 2)

In [12]:
df_kantar = pd.read_clipboard()
#df_kantar.columns = ['shop','12 weeks to aug','c','d','e','f','g','h']

In [13]:
df_kantar
print('number of columns:', len(df_kantar.columns))

number of columns: 8

### here is the sample table that needs to be copied
> This was originally taken from kantar data that was on a monthly email.


index	shop	12 weeks to aug	marketShare	d	e	f	g
0		Sainsbury's	4,146	15.4%	4,599	14.9%	10.9%	
1		Asda	4,019	14.9%	4,402	14.3%	9.5%	
2		Morrisons	2,708	10.1%	3,142	10.2%	16.0%	
3		Aldi	2,168	8.1%	2,444	7.9%	12.7%	
4		Co-op	1,776	6.6%	2,175	7.1%	22.4%	
5		Lidl	1,579	5.9%	1,827	5.9%	15.7%	
6		Waitrose	1,324	4.9%	1,453	4.7%	9.7%	
7		Iceland	581	2.2%	751	2.4%	29.2%	
8		Ocado	373	1.4%	542	1.8%	45.5%	
9		Other Multiples	509	1.9%	590	1.9%	15.9%	
10		Symbols & Independents	460	1.7%	668	2.2%	45.4%

In [14]:
df_kantar.columns = ['index','shop','12 weeks to aug','marketShare','d','e','f','g']
df_kantar

,index,shop,12 weeks to aug,marketShare,d,e,f,g
0,,Sainsbury's,"4,146",15.4%,"4,599",14.9%,10.9%,
1,,Asda,"4,019",14.9%,"4,402",14.3%,9.5%,
2,,Morrisons,"2,708",10.1%,"3,142",10.2%,16.0%,
3,,Aldi,"2,168",8.1%,"2,444",7.9%,12.7%,
4,,Co-op,"1,776",6.6%,"2,175",7.1%,22.4%,
5,,Lidl,"1,579",5.9%,"1,827",5.9%,15.7%,
6,,Waitrose,"1,324",4.9%,"1,453",4.7%,9.7%,
7,,Iceland,581,2.2%,751,2.4%,29.2%,
8,,Ocado,373,1.4%,542,1.8%,45.5%,
9,,Other Multiples,509,1.9%,590,1.9%,15.9%,
10,,Symbols & Independents,460,1.7%,668,2.2%,45.4%,

In [15]:
df = pd.DataFrame({'col_one':['a','b','c','d'],'col_two':[[1,2],[100,200],[10,20],[5,10]]})
df

  col_one     col_two
0       a      [1, 2]
1       b  [100, 200]
2       c    [10, 20]
3       d     [5, 10]

In [16]:
df = pd.DataFrame({'col_one':['a','b','c','d'],'col_two':[(1,2),(100,200),(10,20),(5,10)]})
df

  col_one     col_two
0       a      (1, 2)
1       b  (100, 200)
2       c    (10, 20)
3       d     (5, 10)

In [17]:
df = pd.DataFrame({'col_one':['a','b','c','d'],'col_two':[(1,2),(100,200),(10,20),(5,10)]})
df

  col_one     col_two
0       a      (1, 2)
1       b  (100, 200)
2       c    (10, 20)
3       d     (5, 10)

In [18]:
a= 'hello'
b = (1,2)
c = a+str(b)
c

'hello(1, 2)'

In [19]:
df_new = df.col_two.apply(pd.Series)
df_new

     0    1
0    1    2
1  100  200
2   10   20
3    5   10

In [20]:
df_concat = pd.concat([df,df_new], axis='columns')
df_concat['last_bit'] = df_concat[1]+df_concat[0]
df_concat

  col_one     col_two    0    1  last_bit
0       a      (1, 2)    1    2         3
1       b  (100, 200)  100  200       300
2       c    (10, 20)   10   20        30
3       d     (5, 10)    5   10        15

In [21]:
# higlight min and max
df_styled = df_concat

df_styled

  col_one     col_two    0    1  last_bit
0       a      (1, 2)    1    2         3
1       b  (100, 200)  100  200       300
2       c    (10, 20)   10   20        30
3       d     (5, 10)    5   10        15

In [29]:
df_styled = (df_styled.style
             .highlight_max('col_two', color='red')
             .background_gradient(subset='last_bit', cmap='Blues')
            )

### Notice how the df and the styled df are 2 different objects

In [31]:
print('this is the df:',type(df_concat))
print('this is the styled df',type(df_styled))

this is the df: <class 'pandas.core.frame.DataFrame'>
this is the styled df <class 'pandas.io.formats.style.Styler'>

In [33]:
df_concat['new column 1'] = 1
df_concat

  col_one     col_two    0    1  last_bit  new column 1
0       a      (1, 2)    1    2         3             1
1       b  (100, 200)  100  200       300             1
2       c    (10, 20)   10   20        30             1
3       d     (5, 10)    5   10        15             1